API_REST/app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `userEmail` = 'lvargas9715@gmail.com'
 LIMIT 1
---
    public function findUserByEmailAddress(string $email) {
        $user = $this->asArray()->where([
            'userEmail' =>  $email
        ])->first();