API_REST/app/Controllers/Api.php

INSERT INTO `users` (`custumerName`, `phoneNumber`, `userEmail`, `userPassword`, `profilePic`, `created_at`, `updated_at`) VALUES ('LUIYI VARGAS', '8092700415', 'lvargas9715@gmail.com', '$2y$10$XqKREtsHQxouI3IRuMKItuyUhqByatKsqwq9kwi6CAEcLOyvDlwUa', '3550378112.png', '2023-03-11 20:06:06', '2023-03-11 20:06:06')
---
            // Instanciando el usuario
            $userModel = new UserModel;
            // Guardando la informacion validada
            $userModel->save([
                // Deberia de ser customerName*
                'custumerName'  =>  $input['userName'],
                'phoneNumber'  =>  $input['userPhoneNumber'],
                'userEmail'  =>  $input['userEmail'],
                'userPassword'  =>  $input['userPassword'],
                'profilePic'  =>  $name
            ]);